--Oracle�ADB2�ASQL Server�APostgreSQL
SELECT shohin_bunrui, torokubi, SUM(hanbai_tanka) AS sum_tanka
  FROM Shohin
 GROUP BY shohin_bunrui, torokubi;



  shohin_bunrui |  torokubi  | sum_tanka 
---------------+------------+-----------
 衣服          |            |      4000
 キッチン用品  | 2009-01-15 |      6800
 衣服          | 2009-09-20 |      1000
 キッチン用品  | 2008-04-28 |       880
 事務用品      | 2009-11-11 |       100
 事務用品      | 2009-09-11 |       500
 キッチン用品  | 2009-09-20 |      3500
(7 rows)



 select * from Shohin;
   shohin_id |   shohin_mei   | shohin_bunrui | hanbai_tanka | shiire_tanka |  torokubi  
-----------+----------------+---------------+--------------+--------------+------------
 0001      | Tシャツ        | 衣服          |         1000 |          500 | 2009-09-20
 0002      | 穴あけパンチ   | 事務用品      |          500 |          320 | 2009-09-11
 0003      | カッターシャツ | 衣服          |         4000 |         2800 | 
 0004      | 包丁           | キッチン用品  |         3000 |         2800 | 2009-09-20
 0005      | 圧力鍋         | キッチン用品  |         6800 |         5000 | 2009-01-15
 0006      | フォーク       | キッチン用品  |          500 |              | 2009-09-20
 0007      | おろしがね     | キッチン用品  |          880 |          790 | 2008-04-28
 0008      | ボールペン     | 事務用品      |          100 |              | 2009-11-11
(8 rows)
